OpenPuya/PY32L020_Firmware/Drivers/PY32L020_HAL_Driver/Src/py32l020_hal_comp.c
  /* Return HAL COMP handle state */
  return hcomp->State;
}

/**
  * @brief  Return the COMP error code.
  * @param hcomp COMP handle
  * @retval COMP error code
  */
uint32_t HAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameters */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return hcomp->ErrorCode;
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup COMP_Private_Functions
  * @{
  */

/**
  * @brief  Configure the Vrefcmp
  * @param  hcomp  COMP handle
  * @retval None
  */
static void COMP_VrefConfig(COMP_HandleTypeDef *hcomp)
{
  FlagStatus comp1clkchanged = RESET;
  FlagStatus adcclkchanged = RESET;
    
  if((hcomp->Init.VrefSrc == COMP_VREFCMP_SOURCE_VREFBUF1P5V)   || \
     (hcomp->Init.VrefSrc == COMP_VREFCMP_SOURCE_VREFBUF2P048V) || \
     (hcomp->Init.VrefSrc == COMP_VREFCMP_SOURCE_VREFBUF2P5V))
  { 
    if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
    {
      __HAL_RCC_ADC_CLK_ENABLE();
      adcclkchanged = SET;
    }
    SET_BIT(ADC1_COMMON->CCR,ADC_CCR_VREFEN);
    MODIFY_REG(ADC1->CR, ADC_CR_VREF_BUFFERE | ADC_CR_VREFBUFF_SEL, (ADC_CR_VREF_BUFFERE | hcomp->Init.VrefSrc));
            
    /* Restore clock configuration if changed */
    if (adcclkchanged == SET)
    {
      __HAL_RCC_ADC_CLK_DISABLE();
    }
  }   
  if (__HAL_RCC_COMP1_IS_CLK_DISABLED() != 0U)
  {
    __HAL_RCC_COMP1_CLK_ENABLE();
    comp1clkchanged = SET;
  }  
  
  MODIFY_REG(COMP12_COMMON->CSR_ODD, COMP_CSR_COMP_VCSEL, hcomp->Init.VrefSrc);
  MODIFY_REG(COMP12_COMMON->CSR_ODD, COMP_CSR_COMP_VCDIV_EN | COMP_CSR_COMP_VCDIV, hcomp->Init.VrefDiv);   
  /* Restore clock configuration if changed */
  if (comp1clkchanged == SET)
  {
    __HAL_RCC_COMP1_CLK_DISABLE();
  }    
    
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */



#endif /* HAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
